read_liberty -lib redstone.lib;
read_verilog -sv pong.sv;
show -format dot -viewer true -prefix pong_block pong

# simple synth
synth -top pong

# elaborate design hierarchy
hierarchy -check -top pong

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt    
dfflibmap -liberty redstone.lib;

abc -liberty redstone.lib;
clean; write_blif pong.blif;
show -format dot -viewer true -prefix pong_gates pong
ltp